
  ___  ____  ____  ____  ____ ®
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       MP—Parallel Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: 22-user 8-core network, expiring 30 Jun 2025
Serial number: 501809309427
  Licensed to: The University of Chicago Booth School of Business
               Mercury Computing Cluster

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. More than 2 billion observations are allowed; see help obs_advice.
      4. Maximum number of variables is set to 5,000; see help set_maxvar.


Running /home/tjacobs0/ado/profile.do ...

. do merge_lobbying_corp.do 

. 
. 
. *Merging Lobbying Records with Business Names
. global data "~/developers/raw/nyc_housing"

. global output "~/developers/derived/nyc"

. 
. 
. *Load in Corp Data
. use "${data}/Active_Corporations___Beginning_1800_20240202", clear

. 
. 
. replace entity = strlower(entity)
(3,715,133 real changes made)

. bys currententityname: keep if _n == 1
(1,074 observations deleted)

. 
. rename currententityname entity

. compress
  entitytype is strL now coalesced
  dosprocessname is strL now coalesced
  ceoname is strL now coalesced
  ceoaddress1 is strL now coalesced
  locationname is strL now coalesced
  (408,566,616 bytes saved)

. 
. 
. *Splitting By First String
. forvalues i = 1/26 {
  2.         preserve
  3.     // Convert the loop index to the corresponding ASCII code for lowercas
> e letters
.     local letter = char(`i' + 96)
  4.     
.         keep if substr(entity,1,1) == "`letter'"
  5.         tempfile corp_`letter'
  6.         save `corp_`letter''
  7.         restore
  8. }
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000002 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000004 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000006 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000008 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000a saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000c saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000e saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000g saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000i saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000k saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000m saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000o saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000q saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000s saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000u saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00000w saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000010 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000012 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000014 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000016 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.000018 saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00001a saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00001c saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00001e saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00001g saved as .dta format
(3,714,059 observations deleted)
(dataset contains 0 observations)
file /scratch/tjacobs0/11226371/St427305.00001i saved as .dta format

. forvalues i = 0/9 {
  2.         preserve
  3.     // Convert the loop index to the corresponding ASCII code for lowercas
> e letters
.     
.         keep if substr(entity,1,1) == "`i'"
  4.         tempfile corp_`i'
  5.         save `corp_`i''
  6.         restore
  7. }
(3,713,743 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001k saved as .dta format
(3,626,514 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001m saved as .dta format
(3,662,664 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001o saved as .dta format
(3,676,560 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001q saved as .dta format
(3,686,624 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001s saved as .dta format
(3,690,413 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001u saved as .dta format
(3,696,947 observations deleted)
file /scratch/tjacobs0/11226371/St427305.00001w saved as .dta format
(3,697,736 observations deleted)
file /scratch/tjacobs0/11226371/St427305.000020 saved as .dta format
(3,699,733 observations deleted)
file /scratch/tjacobs0/11226371/St427305.000022 saved as .dta format
(3,701,604 observations deleted)
file /scratch/tjacobs0/11226371/St427305.000024 saved as .dta format

. 
. *Loading in Lobbying Data
. import delim "${data}/lobbying/City_Clerk_eLobbyist_Data_20240201.csv", clear
(encoding automatically selected: ISO-8859-1)
(28 vars, 71,904 obs)

. keep if client_industry == "Real Estate, Construction, Engineering & Develope
> r"
(45,745 observations deleted)

. rename client_name entity 

. 
. replace entity = strlower(entity)
(26,159 real changes made)

. collapse (rawsum) compensation_total, by(entity)

. 
. 
. *Splitting By First String
. forvalues i = 1/26 {
  2.         preserve
  3.     // Convert the loop index to the corresponding ASCII code for lowercas
> e letters
.     local letter = char(`i' + 96)
  4.     
.         keep if substr(entity,1,1) == "`letter'"
  5.         
.         merge 1:1 entity using `corp_`letter'', keep(1 3)
  6.         
.         tempfile merge_`letter'
  7.         save `merge_`letter''
  8.         restore
  9. }
(1,981 observations deleted)
key variable entity is strL in using data.
    The key variables -- the variables on which observations are matched --
    can be str#, but they cannot be strLs.
r(106);

end of do-file
r(106);
